app/views/investments/new.html.erb

      <%= f.input :issuance_id do %>
        <%= f.select :issuance_id, Issuance.all.map { |i| [i.name, i.id,] }, include_blank: true %>
---
SELECT "issuances".* FROM "issuances"