app/views/issuances/index.html.erb

SELECT "investments".* FROM "investments" WHERE "investments"."issuance_id" = $1  [["issuance_id", 6]]
SELECT COUNT(*) FROM "investments" WHERE "investments"."issuance_id" = $1  [["issuance_id", 6]]
SELECT SUM("investments"."amount_of_money") FROM "investments" WHERE "investments"."issuance_id" = $1  [["issuance_id", 2]]
---
      <p>Currently investable? <%= issuance.investable? %></p>
      <p>Number of investments received: <%= issuance.investments.count %></p>
      <% summary_investments = issuance.investments.all.map { |i| [i.amount_of_money.to_f,] } %>