app/controllers/investments_controller.rb

SELECT "investments".* FROM "investments"
---
    def index
    @investments = Investment.all

SELECT "investments".* FROM "investments" WHERE "investments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @investment = Investment.find(params[:id])

INSERT INTO "investments" ("amount_of_money", "issuance_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["amount_of_money", "300.0"], ["issuance_id", 2], ["created_at", "2021-09-25 20:39:47.137237"], ["updated_at", "2021-09-25 20:39:47.137237"]]
---
  def create
    @investment = Investment.new(investment_params)
     respond_to do |format|
      if @investment.save