app/controllers/issuances_controller.rb

  def index
    @issuances = Issuance.all
---
SELECT "issuances".* FROM "issuances"

  def show
    @issuance = Issuance.find(params[:id])
---
SELECT "issuances".* FROM "issuances" WHERE "issuances"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @issuance = Issuance.new(issuance_params)
    respond_to do |format|
      if @issuance.save
---
INSERT INTO "issuances" ("name", "date", "volume", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "issuance-1"], ["date", "2021-09-27 00:00:00"], ["volume", "20000.0"], ["created_at", "2021-09-26 20:47:04.117304"], ["updated_at", "2021-09-26 20:47:04.117304"]]

  def edit
    @issuance = Issuance.find(params[:id])
---
SELECT "issuances".* FROM "issuances" WHERE "issuances"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    @issuance = Issuance.find(params[:id])
    @issuance.update(issuance_params)
---
SELECT "issuances".* FROM "issuances" WHERE "issuances"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "issuances" SET "name" = $1, "date" = $2, "volume" = $3, "updated_at" = $4 WHERE "issuances"."id" = $5  [["name", "Issuance_1"], ["date", "2021-09-25 00:00:00"], ["volume", "10000.0"], ["updated_at", "2021-09-25 19:04:46.935282"], ["id", 4]]