app/models/issuance.rb

SELECT SUM("investments"."amount_of_money") FROM "investments" WHERE "investments"."issuance_id" = $1  [["issuance_id", 2]]
---
   def investable?
    total = self.investments.sum(:amount_of_money)

SELECT SUM("investments"."amount_of_money") FROM "investments" WHERE "investments"."issuance_id" = $1  [["issuance_id", 6]]
---
  def total_investments
    return self.investments.sum(:amount_of_money)